# ToposolidSubregionOverlap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..ToposolidSubregionOverlap Property
BuiltInFailures..::..OverlapFailures Class See Also
---
Highlighted toposolid and sub-division overlap.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ToposolidSubregionOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ToposolidSubregionOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ToposolidSubregionOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace